/*
package algorithm;

public class test2 {
    public static void main(String[] args) {
        //월요일 해야 할 사항들.
        //1.최영훈 책임님 보낸거에 대한 답변. 일단은 로직 수정도 해야 하는 거 같음.
        //2.가장 먼저 해야 할 일은 마스크 관련 agentPC 로직 수정임.
        //등록기에서 했던거 처럼 관련해서 로직 어떻게 타는지 확인 후에 해당 로직의 쿼리들 다 수정
        //3.데이터 어디다가 저장하는지 최영훈 책임님 보내기.
        //4.마스크 점수 관련 로직 짜기.
        //***수요일은 야근 못하니 월 화 최대한 해서 끝내기
        //6.얼굴 등록기 관련 이슈 9시부터
        //7.얼굴 등록기 관련 에스원에 반영 후 테스트


        //동적사진을 저장하는 테이블이 어딘지. 그 테이블에 사진이 INSERT된 날짜도 저장하고 있는지가 중요. 저장하고 있으면 겜끝.
        *****동적사진의 경우 list형식으로 들어오는지 아니면 한 장씩 들어오는지 필히 확인해야함
                그거에 따라 로직이 변경 됨

        일단 아래의 로직은 한 장씩 들어온다고 가정함.

        // 5 3 3 점수 판단
        //테이블 먼저 생성 ( 점수, 사진 들어온 기간 등)
        //SDKConfigMaskVersion
        //동적사진 대체 개수
        //동적사진 대체 여부?
        //mask점수 ->
        Integer maskPoint = 60; //db에서 값가져오도록 변경 예정
        Integer photoSaveCount = 2;//db에서 가져오도록
        //1.agent PC로도 동적사진아닌 사진이 들어오는가?
        //2.


        //사진 점수 비교 로직 . 일단은 교체하는 사진이 1장이라는 가정하에 로직을 짬. => 추후 교체 사진의 갯수는 변수로 받음.
        //마스크 쓴 사진
        //1.테이블에서 해당 마스크 쓴 사진의 점수를 가져옴 (이럴려면 테이블에 점수가 있어야 함. 어느 테이블에 있는지 확인 할 것.)
        //쿼리만 잘짜면 로직 뭐 돌릴 필요 없음. 변경할 사진의 개수 = changePhotoCount 라고 가정.
        select * t_photo_m
            where photoInsertPeriod > 오늘날짜 - 한달 ==>  ex) '20200703' 뭐 이런식으로
                가져온다음에 날짜순으로 정렬함
            order by changed_date desc;
        //where rownum = photoSaveCount; 이렇게 하면  최대 3개 뽑혔을 거임. (3개만 저장하니까)
        where rownum = 1;

        위의 해당쿼리로 값이 존재하지 않는다면
        설정한 개월 수를 초과한 사진이 존재하지 않는다는거임. 이럴 떄는 그냥 들어온사진은 저장안하고 로직 타도록 하면 됨.



        ***현재의 동적사진 교체 로직 판단 할것.
        테이블에 넣기전에 백업테이블에 넣는지.
        삭제가 아니라 useyn같은 컬럼을 업데이트 치는지. 등 판단해야함.



        //1.

        //오늘 날짜 - 한달.
        //(최대 3장 가져옴) arg1, arg2, arg3 이라고 가정. sublist 에 담겨있다고 가정.

        //2.최대 3장의 점수와 지금 들어온 사진의 점수를 비교.
        if(maskPoint > 60 ) {

        }


        //마스크 안 쓴 사진

    }
}
*/
